#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.networking.data.aws_availability_zones.available: Reading...
module.compute.data.aws_ami.ubuntu: Reading...
module.networking.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.compute.data.aws_ami.ubuntu: Read complete after 0s [id=ami-0030e4319cbf4dbf2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.compute.aws_instance.web[0] will be created
  + resource "aws_instance" "web" {
      + ami                                  = "ami-0030e4319cbf4dbf2"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "us-east-1"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "gitops-ansible-pull-Obs"
          + "Project"     = "gitops-ansible-pull"
          + "Role"        = "Obs"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "gitops-ansible-pull-Obs"
          + "Project"     = "gitops-ansible-pull"
          + "Role"        = "Obs"
        }
      + tenancy                              = (known after apply)
      + user_data                            = <<-EOT
            #!/bin/bash
            set -e
            
            # Logs visibles via cloud-init-output.log
            exec > >(tee /var/log/user-data.log) 2>&1
            
            echo "=========================================="
            echo "Démarrage de la configuration de l'instance"
            echo "=========================================="
            
            # 1. Dépendances de base
            echo "[1/7] Installation des dépendances..."
            apt-get update -y
            apt-get install -y software-properties-common git python3-pip curl jq
            
            # 2. Installation Ansible
            echo "[2/7] Installation d'Ansible..."
            pip3 install ansible
            
            # 3. Récupération du tag Name depuis les métadonnées EC2
            echo "[3/7] Récupération du rôle de l'instance..."
            TOKEN=$(curl -X PUT "http://169.254.169.254/latest/api/token" -H "X-aws-ec2-metadata-token-ttl-seconds: 21600" 2>/dev/null)
            INSTANCE_ID=$(curl -H "X-aws-ec2-metadata-token: $TOKEN" http://169.254.169.254/latest/meta-data/instance-id 2>/dev/null)
            REGION=$(curl -H "X-aws-ec2-metadata-token: $TOKEN" http://169.254.169.254/latest/meta-data/placement/region 2>/dev/null)
            
            # Récupération du tag Role de l'instance
            ROLE=$(aws ec2 describe-tags               --region "$REGION"               --filters "Name=resource-id,Values=$INSTANCE_ID" "Name=key,Values=Role"               --query "Tags[0].Value"               --output text 2>/dev/null || echo "unknown")
            
            echo "Instance ID: $INSTANCE_ID"
            echo "Region: $REGION"
            echo "Role détecté: $ROLE"
            
            # 4. Configuration du rôle pour Ansible
            echo "[4/7] Configuration du rôle Ansible..."
            mkdir -p /etc/ansible
            echo "role=$ROLE" > /etc/ansible/role.conf
            chmod 644 /etc/ansible/role.conf
            
            cat /etc/ansible/role.conf
            echo "Fichier de configuration créé: /etc/ansible/role.conf"
            
            # 5. Répertoire de travail Ansible
            echo "[5/7] Création du répertoire de travail..."
            mkdir -p /opt/ansible
            chown root:root /opt/ansible
            
            # 6. Premier run Ansible Pull
            echo "[6/7] Exécution d'Ansible Pull..."
            ansible-pull               -d /opt/ansible               -U https://github.com/AristideWafo/gitops-ansible-pull.git               -C main               -i localhost,               -e "instance_role=$ROLE"               playbooks/site.yml
            
            # 7. Configuration du timer systemd pour les exécutions périodiques
            echo "[7/7] Configuration du timer systemd..."
            if [ -f /opt/ansible/systemd/ansible-pull.service ] && [ -f /opt/ansible/systemd/ansible-pull.timer ]; then
              cp /opt/ansible/systemd/ansible-pull.service /etc/systemd/system/
              cp /opt/ansible/systemd/ansible-pull.timer /etc/systemd/system/
            
              systemctl daemon-reload
              systemctl enable --now ansible-pull.timer
              echo "Timer systemd configuré et activé"
            else
              echo "Fichiers systemd non trouvés, configuration manuelle du cron..."
              # Fallback sur cron si les fichiers systemd ne sont pas présents
              echo "*/15 * * * * root ansible-pull -d /opt/ansible -U https://github.com/AristideWafo/gitops-ansible-pull.git -C main -i localhost, -e "instance_role=$ROLE" playbooks/site.yml >> /var/log/ansible-pull.log 2>&1" > /etc/cron.d/ansible-pull
              chmod 644 /etc/cron.d/ansible-pull
              echo "Cron configuré pour exécution toutes les 15 minutes"
            fi
            
            echo "=========================================="
            echo "Configuration terminée avec succès!"
            echo "Rôle: $ROLE"
            echo "=========================================="
        EOT
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = "gp3"
        }
    }

  # module.compute.aws_instance.web[1] will be created
  + resource "aws_instance" "web" {
      + ami                                  = "ami-0030e4319cbf4dbf2"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "us-east-1"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "gitops-ansible-pull-App"
          + "Project"     = "gitops-ansible-pull"
          + "Role"        = "App"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "gitops-ansible-pull-App"
          + "Project"     = "gitops-ansible-pull"
          + "Role"        = "App"
        }
      + tenancy                              = (known after apply)
      + user_data                            = <<-EOT
            #!/bin/bash
            set -e
            
            # Logs visibles via cloud-init-output.log
            exec > >(tee /var/log/user-data.log) 2>&1
            
            echo "=========================================="
            echo "Démarrage de la configuration de l'instance"
            echo "=========================================="
            
            # 1. Dépendances de base
            echo "[1/7] Installation des dépendances..."
            apt-get update -y
            apt-get install -y software-properties-common git python3-pip curl jq
            
            # 2. Installation Ansible
            echo "[2/7] Installation d'Ansible..."
            pip3 install ansible
            
            # 3. Récupération du tag Name depuis les métadonnées EC2
            echo "[3/7] Récupération du rôle de l'instance..."
            TOKEN=$(curl -X PUT "http://169.254.169.254/latest/api/token" -H "X-aws-ec2-metadata-token-ttl-seconds: 21600" 2>/dev/null)
            INSTANCE_ID=$(curl -H "X-aws-ec2-metadata-token: $TOKEN" http://169.254.169.254/latest/meta-data/instance-id 2>/dev/null)
            REGION=$(curl -H "X-aws-ec2-metadata-token: $TOKEN" http://169.254.169.254/latest/meta-data/placement/region 2>/dev/null)
            
            # Récupération du tag Role de l'instance
            ROLE=$(aws ec2 describe-tags               --region "$REGION"               --filters "Name=resource-id,Values=$INSTANCE_ID" "Name=key,Values=Role"               --query "Tags[0].Value"               --output text 2>/dev/null || echo "unknown")
            
            echo "Instance ID: $INSTANCE_ID"
            echo "Region: $REGION"
            echo "Role détecté: $ROLE"
            
            # 4. Configuration du rôle pour Ansible
            echo "[4/7] Configuration du rôle Ansible..."
            mkdir -p /etc/ansible
            echo "role=$ROLE" > /etc/ansible/role.conf
            chmod 644 /etc/ansible/role.conf
            
            cat /etc/ansible/role.conf
            echo "Fichier de configuration créé: /etc/ansible/role.conf"
            
            # 5. Répertoire de travail Ansible
            echo "[5/7] Création du répertoire de travail..."
            mkdir -p /opt/ansible
            chown root:root /opt/ansible
            
            # 6. Premier run Ansible Pull
            echo "[6/7] Exécution d'Ansible Pull..."
            ansible-pull               -d /opt/ansible               -U https://github.com/AristideWafo/gitops-ansible-pull.git               -C main               -i localhost,               -e "instance_role=$ROLE"               playbooks/site.yml
            
            # 7. Configuration du timer systemd pour les exécutions périodiques
            echo "[7/7] Configuration du timer systemd..."
            if [ -f /opt/ansible/systemd/ansible-pull.service ] && [ -f /opt/ansible/systemd/ansible-pull.timer ]; then
              cp /opt/ansible/systemd/ansible-pull.service /etc/systemd/system/
              cp /opt/ansible/systemd/ansible-pull.timer /etc/systemd/system/
            
              systemctl daemon-reload
              systemctl enable --now ansible-pull.timer
              echo "Timer systemd configuré et activé"
            else
              echo "Fichiers systemd non trouvés, configuration manuelle du cron..."
              # Fallback sur cron si les fichiers systemd ne sont pas présents
              echo "*/15 * * * * root ansible-pull -d /opt/ansible -U https://github.com/AristideWafo/gitops-ansible-pull.git -C main -i localhost, -e "instance_role=$ROLE" playbooks/site.yml >> /var/log/ansible-pull.log 2>&1" > /etc/cron.d/ansible-pull
              chmod 644 /etc/cron.d/ansible-pull
              echo "Cron configuré pour exécution toutes les 15 minutes"
            fi
            
            echo "=========================================="
            echo "Configuration terminée avec succès!"
            echo "Rôle: $ROLE"
            echo "=========================================="
        EOT
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = "gp3"
        }
    }

  # module.compute.aws_instance.web[2] will be created
  + resource "aws_instance" "web" {
      + ami                                  = "ami-0030e4319cbf4dbf2"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "us-east-1"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "gitops-ansible-pull-Vault"
          + "Project"     = "gitops-ansible-pull"
          + "Role"        = "Vault"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "gitops-ansible-pull-Vault"
          + "Project"     = "gitops-ansible-pull"
          + "Role"        = "Vault"
        }
      + tenancy                              = (known after apply)
      + user_data                            = <<-EOT
            #!/bin/bash
            set -e
            
            # Logs visibles via cloud-init-output.log
            exec > >(tee /var/log/user-data.log) 2>&1
            
            echo "=========================================="
            echo "Démarrage de la configuration de l'instance"
            echo "=========================================="
            
            # 1. Dépendances de base
            echo "[1/7] Installation des dépendances..."
            apt-get update -y
            apt-get install -y software-properties-common git python3-pip curl jq
            
            # 2. Installation Ansible
            echo "[2/7] Installation d'Ansible..."
            pip3 install ansible
            
            # 3. Récupération du tag Name depuis les métadonnées EC2
            echo "[3/7] Récupération du rôle de l'instance..."
            TOKEN=$(curl -X PUT "http://169.254.169.254/latest/api/token" -H "X-aws-ec2-metadata-token-ttl-seconds: 21600" 2>/dev/null)
            INSTANCE_ID=$(curl -H "X-aws-ec2-metadata-token: $TOKEN" http://169.254.169.254/latest/meta-data/instance-id 2>/dev/null)
            REGION=$(curl -H "X-aws-ec2-metadata-token: $TOKEN" http://169.254.169.254/latest/meta-data/placement/region 2>/dev/null)
            
            # Récupération du tag Role de l'instance
            ROLE=$(aws ec2 describe-tags               --region "$REGION"               --filters "Name=resource-id,Values=$INSTANCE_ID" "Name=key,Values=Role"               --query "Tags[0].Value"               --output text 2>/dev/null || echo "unknown")
            
            echo "Instance ID: $INSTANCE_ID"
            echo "Region: $REGION"
            echo "Role détecté: $ROLE"
            
            # 4. Configuration du rôle pour Ansible
            echo "[4/7] Configuration du rôle Ansible..."
            mkdir -p /etc/ansible
            echo "role=$ROLE" > /etc/ansible/role.conf
            chmod 644 /etc/ansible/role.conf
            
            cat /etc/ansible/role.conf
            echo "Fichier de configuration créé: /etc/ansible/role.conf"
            
            # 5. Répertoire de travail Ansible
            echo "[5/7] Création du répertoire de travail..."
            mkdir -p /opt/ansible
            chown root:root /opt/ansible
            
            # 6. Premier run Ansible Pull
            echo "[6/7] Exécution d'Ansible Pull..."
            ansible-pull               -d /opt/ansible               -U https://github.com/AristideWafo/gitops-ansible-pull.git               -C main               -i localhost,               -e "instance_role=$ROLE"               playbooks/site.yml
            
            # 7. Configuration du timer systemd pour les exécutions périodiques
            echo "[7/7] Configuration du timer systemd..."
            if [ -f /opt/ansible/systemd/ansible-pull.service ] && [ -f /opt/ansible/systemd/ansible-pull.timer ]; then
              cp /opt/ansible/systemd/ansible-pull.service /etc/systemd/system/
              cp /opt/ansible/systemd/ansible-pull.timer /etc/systemd/system/
            
              systemctl daemon-reload
              systemctl enable --now ansible-pull.timer
              echo "Timer systemd configuré et activé"
            else
              echo "Fichiers systemd non trouvés, configuration manuelle du cron..."
              # Fallback sur cron si les fichiers systemd ne sont pas présents
              echo "*/15 * * * * root ansible-pull -d /opt/ansible -U https://github.com/AristideWafo/gitops-ansible-pull.git -C main -i localhost, -e "instance_role=$ROLE" playbooks/site.yml >> /var/log/ansible-pull.log 2>&1" > /etc/cron.d/ansible-pull
              chmod 644 /etc/cron.d/ansible-pull
              echo "Cron configuré pour exécution toutes les 15 minutes"
            fi
            
            echo "=========================================="
            echo "Configuration terminée avec succès!"
            echo "Rôle: $ROLE"
            echo "=========================================="
        EOT
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = "gp3"
        }
    }

  # module.compute.aws_security_group.web will be created
  + resource "aws_security_group" "web" {
      + arn                    = (known after apply)
      + description            = "Security group for web servers"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP from anywhere"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS from anywhere"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH from anywhere"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "gitops-ansible-pull-web-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "gitops-ansible-pull-web-sg"
          + "Project"     = "gitops-ansible-pull"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "gitops-ansible-pull-web-sg"
          + "Project"     = "gitops-ansible-pull"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "us-east-1"
      + tags     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "gitops-ansible-pull-igw"
          + "Project"     = "gitops-ansible-pull"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "gitops-ansible-pull-igw"
          + "Project"     = "gitops-ansible-pull"
        }
      + vpc_id   = (known after apply)
    }

  # module.networking.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "gitops-ansible-pull-public-rt"
          + "Project"     = "gitops-ansible-pull"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "gitops-ansible-pull-public-rt"
          + "Project"     = "gitops-ansible-pull"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table_association.public will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_subnet.public will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "gitops-ansible-pull-public-subnet"
          + "Project"     = "gitops-ansible-pull"
          + "Type"        = "Public"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "gitops-ansible-pull-public-subnet"
          + "Project"     = "gitops-ansible-pull"
          + "Type"        = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "us-east-1"
      + tags                                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "gitops-ansible-pull-vpc"
          + "Project"     = "gitops-ansible-pull"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "gitops-ansible-pull-vpc"
          + "Project"     = "gitops-ansible-pull"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + instance_ids         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + instance_private_ips = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + instance_public_ips  = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + security_group_id    = (known after apply)
  + subnet_id            = (known after apply)
  + vpc_id               = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @AristideWafo, Action: `pull_request`*